---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewScalePulldownImperial
source: html/e277cb12-7b5c-94cb-5343-f4855a9f2b87.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewScalePulldownImperial Property

"View Scale"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewScalePulldownImperial { get; }
```